Revit 2024 API
AnalysisResultSchema Constructor (AnalysisResultSchema)
 Constructs a new copy of the input AnalysisResultSchema object.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public AnalysisResultSchema(
	AnalysisResultSchema other
)
Visual Basic
Public Sub New ( _
	other As AnalysisResultSchema _
)
Visual C++
public:
AnalysisResultSchema(
	AnalysisResultSchema^ other
)
Parameters
other
Type: Autodesk.Revit.DB.Analysis.AnalysisResultSchema
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
AnalysisResultSchema Class
AnalysisResultSchema Overload
Autodesk.Revit.DB.Analysis Namespace